Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/svd/PIC32CK0512GC00064.svd
            <register>
               <name>INTSTAT1</name>
               <description>DMA INTERRUPT PRIORITY 1 STATUS REGISTER</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH0</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH7</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH8</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH9</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH10</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH11</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH12</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH13</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH14</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH15</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH16</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH17</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH18</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH19</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH20</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH21</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH22</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH23</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>0x50</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x50</addressOffset>
               <register>
                  <name>CHCTRLA</name>
                  <description>CHANNEL CONTROL REGISTER A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ENABLE</name>
                        <description>Channel Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LLEN</name>
                        <description>Linked List Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SWFRC</name>
                        <description>Software Forced Trigger</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run In Standby</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHCTRLB</name>
                  <description>CHANNEL CONTROL REGISTER B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>WAS</name>
                        <description>Channel Write Address Sequence.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>WASSelect</name>
                           <enumeratedValue>
                              <name>BYTE_ADDR_INCR</name>
                              <description>Incrementing Address+1 with Transfers of Byte Operands</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF_WORD_ADDR_INCR</name>
                              <description>Incrementing Address+2 with Transfers of HalfWord Operands</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AUTO_ADDR_INCR</name>
                              <description>Auto Increment Address and Transfer Size</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_BYTE_ADDR_INCR</name>
                              <description>Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_HALF_WORD_ADDR_INCR</name>
                              <description>Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_WORD_ADDR_INCR</name>
                              <description>Fixed Address Word Burst Transfer</description>
                              <value>5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RAS</name>
                        <description>Channel Read Address Sequence</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>RASSelect</name>
                           <enumeratedValue>
                              <name>BYTE_ADDR_INCR</name>
                              <description>Incrementing Address+1 with Transfers of Byte Operands</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF_WORD_ADDR_INCR</name>
                              <description>Incrementing Address+2 with Transfers of HalfWord Operands</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AUTO_ADDR_INCR</name>
                              <description>Auto Increment Address and Transfer Size</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_BYTE_ADDR_INCR</name>
                              <description>Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_HALF_WORD_ADDR_INCR</name>
                              <description>Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_WORD_ADDR_INCR</name>
                              <description>Fixed Address Word Burst Transfer</description>
                              <value>5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PRI</name>
                        <description>Channel Priority level.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PRISelect</name>
                           <enumeratedValue>
                              <name>PRI_1</name>
                              <description>Channel Priority is 1</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRI_2</name>
                              <description>Channel Priority is 2</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRI_3</name>
                              <description>Channel Priority is 3 (HIGHEST)</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WBOEN</name>
                        <description>Write Byte Order Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BYTORD</name>
                        <description>Byte Order</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BYTORDSelect</name>
                           <enumeratedValue>
                              <name>BYTORD_NONE</name>
                              <description>Bytes are processed AS IS</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTORD_WORD_SWIZZLE</name>
                              <description>Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTORD_HALF_WORD_SWIZZLE</name>
                              <description>Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTORD_BYTE_SWIZZLE</name>
                              <description>Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRIG</name>
                        <description>Trigger that can Start a Channel Transfer</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>PIGNEN</name>
                        <description>Enable Pattern Ignore Byte</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PATLEN</name>
                        <description>Pattern Match Length</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PATEN</name>
                        <description>Channel Pattern Match Abort Enable.</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CASTEN</name>
                        <description>Cell Auto Start Enable of Ensuing Transfers for this channel</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCEN</name>
                        <description>CRC Enable bit</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHEVCTRL</name>
                  <description>CHANNEL EVENT CONTROL REGISTER</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>EVAUXACT</name>
                        <description>Channel Auxiliary Event Input Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EVAUXACTSelect</name>
                           <enumeratedValue>
                              <name>ABORT_BLK_XFER</name>
                              <description>Event Aborts Bock Transfer</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INCR_CHN_PRI</name>
                              <description>Event Increments Channel Priority</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COND_TRIG</name>
                              <description>Event acts as a Conditional Trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVOMODE</name>
                        <description>Channel Event Output Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EVOMODESelect</name>
                           <enumeratedValue>
                              <name>STRB_ON_BLCK_XFER</name>
                              <description>Generate a channel event strobe for 1 clock cycle at the end of block transfer</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STRB_ON_CELL_XFER</name>
                              <description>Generate a channel event strobe for 1 clock cycle at the end of cell transfer</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STRB_START_EVT_TRG_TO_CELL_XFER_READ</name>
                              <description>Generate a channel event strobe from start event trigger to the completion of cell transfer read</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STRB_START_EVT_TRG_TO_CELL_XFER_WRITE</name>
                              <description>Generate a channel event strobe from start event trigger to the completion of cell transfer write</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVAUXIE</name>
                        <description>Channel Auxiliary Event Enable (0: disable; 1: enable)</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVSTRIE</name>
                        <description>Channel Start Event Input Enable (0: disable; 1:enable)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVOE</name>
                        <description>Channel Event Output Enable (0: disable; 1: enable)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
